# Core shell and terminal stack
brew "zsh"
brew "tmux"
brew "git"

# Shared CLI dependencies
brew "stow"
brew "ripgrep"
brew "fd"
brew "tree-sitter"
brew "zoxide"
brew "lazygit"
brew "fzf"
brew "ruby"
brew "python"
brew "node"
brew "jq"
brew "shellcheck"
brew "shfmt"
brew "yamllint"

# Shell integrations
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Container and Kubernetes tooling used by zsh helpers/completions
brew "docker"
brew "podman"
brew "k9s"
brew "kubectl"
brew "openshift-cli"

# Terminal app and font used by this setup
cask "ghostty"
cask "zed"
cask "nikitabobko/tap/aerospace"
cask "karabiner-elements"
cask "puppetlabs/puppet/pdk"
cask "font-jetbrains-mono-nerd-font"
