# Core shell and terminal stack
brew "zsh"
brew "tmux"
brew "neovim"
brew "git"

# Shared CLI dependencies
brew "ripgrep"
brew "fd"
brew "tree-sitter"
brew "eza"
brew "zoxide"
brew "lazygit"

# Shell integrations
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Container and Kubernetes tooling used by zsh helpers/completions
brew "docker"
brew "podman"
brew "kubectl"
brew "kubecolor"
brew "stern"
brew "jq"
brew "yq"
brew "bat"
brew "openshift-cli"

# Terminal app and font used by this setup
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
